Example/config/0/air/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/boundaryConditions/Air"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cat_in
    {
        type            flowRateInletVelocity;
        massFlowRate    constant $mfrInC;
        value           uniform (0 0 0);
    }
    
    cat_out
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }
    
    ".*wall.*"
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    ".*_to_.*"
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }

}

// ************************************************************************* //
