Example/config/0/air/YH2Oair
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      YH2Oair;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/boundaryConditions/Air"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform $H2OInC;

boundaryField
{
    cat_in
    {
        type            fixedValue;
        value           $internalField;
    }
    
    cat_out
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }

    ".*wall.*"
    {
        type            zeroGradient;
    }
    
    ".*_to_.*"
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
}

// ************************************************************************* //
