Example/config/0/air/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/boundaryConditions/Air"

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform $rhoInC;

boundaryField
{

    cat_in
    {
        type            fixedValue;
        value           $internalField;
    }
    
    cat_out
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }
    
    ".*wall.*"
    {
        type            zeroGradient;
    }
    
    ".*_to_.*"
    {
        type            zeroGradient;
    }     
}

// ************************************************************************* //
