Example/config/0/coolant/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fuel";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/boundaryConditions/Coolant"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    coolant_in
    {
        type            flowRateInletVelocity;
        massFlowRate    constant $mfrInCool;
		rhoInlet        $rhoInCool;
    }
    
    coolant_out
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }
    
    ".*_to_.*"
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    ".*periodic.*"
    {
       type             symmetry;
    }

}

// ************************************************************************* //
