Example/config/0/coolant/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/boundaryConditions/Coolant"

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform $rhoInCool;

boundaryField
{
    coolant_in
    {
        type            fixedValue;
		value           uniform $rhoInCool;
    }
    
    coolant_out
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }
    
    ".*_to_.*"
    {
       type            zeroGradient;
    }
    
     ".*periodic.*"
    {
        type            symmetry;
    }
    

}

// ************************************************************************* //
