Example/config/0/fuel/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/boundaryConditions/Fuel"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOutA;

boundaryField
{
    an_in
    {
        type            zeroGradient;
    }
    
    an_out
    {
        type            fixedValue;
        value           $internalField;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }

    ".*wall.*"
    {
        type            zeroGradient;
    }
    
    ".*_to_.*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
