Example/config/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*in.*"
    {
        type            fixedValue;
        value           uniform 1.0e-15;
    }
    
    ".*out.*"
    {
        type            zeroGradient;
    }
    
    ".*symmetry.*"
    {
        type            symmetry;
    }
    
    ".*wall.*"
    {
        type            zeroGradient;
    }

    ".*periodic.*"
    {
        type            symmetry;
    }
    
    ".*terminal.*"
    {
        type            zeroGradient;
    }
    
}

// ************************************************************************* //
