Example/config/constant/cbp/cbpProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "constant/cbp";
    object          cbpProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/boundaryConditions/Material"

rho             rho     [1 -3 0 0 0 0 0]     $bppRho;
Cp              Cp      [0 2 -2 -1 0 0 0]     $bppCp;
k               k       [1 1 -3 -1 0 0 0]      $bppK;

// ************************************************************************* //
