Example/config/constant/coolant/coolantProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/coolant";
    object      coolantProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho     [1 -3 0 0 0 0 0]       972.97;
mu              mu      [1 -1 -1 0 0 0 0]      4.0553e-4;
Cp              Cp      [0 2 -2 -1 0 0 0]      4194;
k               k       [1 1 -3 -1 0 0 0]      0.656;


// ************************************************************************* //
