Example/config/constant/electrolyte/electrolyteProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/electrolyte";
    object      electrolyteProperties;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/boundaryConditions/Material"

rho             rho          [1 -3 0 0 0 0 0]            $memRho;
Cp              Cp           [0 2 -2 -1 0 0 0]           $memCp;
k               k            [1 1 -3 -1 0 0 0]           $memk;
sigma           sigma        [-1 -2 3 0 0 2 0]           $memElCon; 

// ************************************************************************* //
