Example/config/constant/fuel/fuelProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fuel";
    object      fuelProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Fuel(0.4*H2 + 0.6*H2O by mass) properties @ 353 K

rho             rho     [1 -3 0 0 0 0 0]       0.2483;
mu              mu      [1 -1 -1 0 0 0 0]     1.5e-5;
Cp              Cp      [0 2 -2 -1 0 0 0]     2062.74;
k               k       [1 1 -3 -1 0 0 0]     0.08396;

// hydraulic diameter for Reynolds Number calculation
// code will skip calculation if value = 0
//dHyd            dHyd    [0 1 0 0 0 0 0]      0;
dHyd            dHyd    [0 1 0 0 0 0 0]      1.0e-3;

diffusivity
{
    //type        fixedDiffusivity;
    //diff0       diff0 [0 2 -1 0 0 0 0]  1.22e-4;
    // --------------------------------------
    type        binaryFSG;
    Tname       T;
    pName       p;
    speciesA    H2;
    speciesB    H2O;
    speciesC    N2;
}

// ************************************************************************* //
