Example/config/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/air";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 1000;
    }

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           0.001;
        minIter          1;
        maxIter          1000;
    }
    

    YO2air
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        GaussSeidel;
    }
    
    YH2Oair
    {
        solver          GAMG;
        tolerance       1e-04;
        relTol          0.001;
        smoother        GaussSeidel;
    }
    
}

PISO
{
    nIteration                 0;
    nCorrectors                2;
    nNonOrthogonalCorrectors   0;
    pRefCell                   0;
    pRefValue                  0;
}


relaxationFactors
{
    p               0.3;
    U               0.7;
    YO2air          0.8;
    YH2Oair         0.8;
}


// ************************************************************************* //
